# GetLayerDeltaZOffset

## Description
_Vectorworks 2012 Deprecated Functions_. See architectural category for replacement:
:DelObjStoryBound
:DelObjStoryBounds
:GetObjBoundElevation
:GetObjStoryBound
:GetObjStoryBoundsAt
:GetObjStoryBoundsCnt
:GetStoryLayerInfo
:HasObjStoryBound
:HasObjStoryBounds
:SetObjectStoryBound

Returns the wall height's offset to the layer delta z.

```pascal
FUNCTION GetLayerDeltaZOffset(theWall : HANDLE): REAL;
```

```python
def vs.GetLayerDeltaZOffset(theWall):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theWall|HANDLE|The wall.|

## Examples
```pascal
resultVal := GetLayerDeltaZOffset(theWall);
```
```python
import vs

# _Vectorworks 2012 Deprecated Functions_.
theWall = vs.FSActLayer()  # handle to the first selected object on the active layer

value = vs.GetLayerDeltaZOffset(theWall)
vs.Message('GetLayerDeltaZOffset returned: ' + str(value))
```

## See Also
VS Functions:
SetLayerDeltaZOffset

## Version
Availability: from VectorWorks12.5
Deprecated: Vectorworks 2012 Deprecated Functions

## Category
* Objects - Walls